OpenFOAM-v2412/tutorials/incompressible/pimpleFoam/LES/surfaceMountedCube/fullCase/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 7.5e-5;

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        offset          0;
        setAverage      off;
        mapMethod       nearest;
//        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    "(cube|topAndBottom)"
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
